workstation/tutorials/multiphase/interFoam/laminar/vofToLagrangian/eulerianInjection/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    faceToFace
    {
        set         injectorFaces;

        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volVectorFieldValue U (0 -15 0)
        );
    }
);


// ************************************************************************* //
